climate.org
#+TITLE: Climate
#+DESCRIPTION:

#+INCLUDE: "../web/config.org"

* Preamble

Notes based on /Atmosphere, Ocean, and Climate Dynamics: An Introducory Txt/ by John Marshall and R. Alan Plumb

written in literate single-file clojure: https://geokon-gh.github.io/literate-clojure.html

** Loading Libraries
Here I load a bunch of libraries. I use the ~geo~ library to work with GIS files and then I use ~thing/geom~ to display the result as an inline SVG. 
#+BEGIN_SRC clojure :exports code
  (use 'clojure.tools.deps.alpha.repl)
#+END_SRC

#+RESULTS:
: nil

#+BEGIN_SRC clojure :exports code
;; Add libraries for plotting
(add-libs {'thi.ng/geom {:mvn/version "1.0.0-RC4"}})
(add-libs {'thi.ng/math {:mvn/version "0.3.0"}})
(add-libs {'thi.ng/ndarray {:mvn/version "0.3.2"}})
(add-libs {'thi.ng/color {:mvn/version "1.4.0"}})
(add-libs {'factual/geo {:mvn/version "3.0.1"}})
(add-libs {'com.github.jai-imageio/jai-imageio-core {:mvn/version "1.4.0"}})
(add-libs {'clj-curl/clj-curl {:mvn/version "1.1.2"}})
(add-libs {'guru.nidi.com.kitfox/svgSalamander {:mvn/version "1.1.3"}})
(add-libs {'batik-rasterize/batik-rasterize {:mvn/version "0.1.2"}
           'xerces/xerces {:mvn/version  "2.4.0"}
           'org.apache.xmlgraphics/batik-transcoder {:mvn/version  "1.14"}
           'org.apache.xmlgraphics/batik-codec {:mvn/version  "1.10"}
           'org.apache.xmlgraphics/batik-anim {:mvn/version  "1.10"}
           'org.apache.xmlgraphics/xmlgraphics-commons {:mvn/version  "2.3"}})
#+END_SRC

#+RESULTS:
: nilnilnilnilnilnilnilnilnilnil

#+BEGIN_SRC clojure :exports code
;; Add them to the default ~user~ namespace
(require '[clojure.java.io :as io]
         '(thi.ng.geom [core :as geom]
                       [matrix :as matrix])
         '[thi.ng.geom.viz.core :as viz]
         '[thi.ng.geom.svg.core :as svg]
         '[thi.ng.math.core :as math]
         '[thi.ng.ndarray.core :as ndarray]
         '[thi.ng.color.core :as col]
         '[thi.ng.math.noise :as noise]
         '[clj-curl.easy :as curl-easy]
         '[clj-curl.opts :as curl-opts]
         '[batik.rasterize :as batik])
(use 'geo.io)
(use 'geo.jts)
(use '[uncomplicate.neanderthal core native])
#+END_SRC

#+RESULTS:
: nilnilnilnil

