climate.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Climate</title>
<meta name="author" content="George Kontsevich" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../web/kxygk.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">

</head>
<body>
<div id="content" class="content">
<h1 class="title">Climate</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge779a20">Preamble</a>
<ul>
<li><a href="#orgab148c9">Loading Libraries</a></li>
<li><a href="#org01126ee">SVG Utils</a></li>
</ul>
</li>
<li><a href="#org59b315b">Intro</a>
<ul>
<li><a href="#org14db3e3">Primary Driver is Temperature</a></li>
<li><a href="#org94e6f68">Rotating Sphere</a></li>
<li><a href="#orgb510327">Multigas system</a></li>
</ul>
</li>
<li><a href="#org465ec91">Global Energy Balance</a>
<ul>
<li><a href="#org0f92ee9">The Sun</a></li>
<li><a href="#org096015d">Solar Flux</a></li>
<li><a href="#org10caee8">Albedo</a></li>
<li><a href="#org2b30d4c">Black body radiation</a></li>
<li><a href="#org7064aec">Greenhouse effect</a>
<ul>
<li><a href="#org485d81f">Simply opaque model</a></li>
<li><a href="#org5c9b66a">Leaky model</a></li>
<li><a href="#orgf6f12ce">Feedback</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org476d48e">Vertical Structure</a>
<ul>
<li><a href="#org76240fa">Layers</a></li>
<li><a href="#orga111b73">Pressure</a></li>
</ul>
</li>
<li><a href="#org949bc77">Convection</a>
<ul>
<li><a href="#org215a9da">In Water</a></li>
<li><a href="#org7634910">Dry Convection in Air</a></li>
<li><a href="#orgae98ff1">Potential Temperature</a></li>
<li><a href="#org7d6f765">Moist Air Convection</a></li>
<li><a href="#org84b367c">Equivalent potential temperature</a></li>
</ul>
</li>
<li><a href="#org42937ec">Meridonal structure of the atmosphere</a>
<ul>
<li>
<ul>
<li><a href="#orga77acbd">Tilt</a></li>
<li><a href="#orgb7e2b99">Sphericity</a></li>
<li><a href="#orge7d4e67">Potential temperature</a></li>
<li><a href="#org817ba0b">Equivalent potential temperature</a></li>
<li><a href="#org45aac81">Stratosphere</a></li>
</ul>
</li>
<li><a href="#orga3e790d">Pressure vs Height</a></li>
<li><a href="#orgc501438">Winds</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge779a20" class="outline-2">
<h2 id="orge779a20">Preamble</h2>
<div class="outline-text-2" id="text-orge779a20">
<p>
Notes based on <i>Atmosphere, Ocean, and Climate Dynamics: An Introducory Txt</i> by John Marshall and R. Alan Plumb
</p>

<p>
written in literate single-file clojure: <a href="https://geokon-gh.github.io/literate-clojure.html">https://geokon-gh.github.io/literate-clojure.html</a>
</p>
</div>

<div id="outline-container-orgab148c9" class="outline-3">
<h3 id="orgab148c9">Loading Libraries</h3>
<div class="outline-text-3" id="text-orgab148c9">
<p>
Here I load a bunch of libraries. I use the <code>geo</code> library to work with GIS files and then I use <code>thing/geom</code> to display the result as an inline SVG. 
</p>
<div class="org-src-container">
<pre class="src src-clojure">  (use 'clojure.tools.deps.alpha.repl)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8b0000;">;; </span><span style="color: #8b0000;">Add libraries for plotting</span>
(add-libs {'<span style="color: #000000;">thi.ng</span>/geom {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"1.0.0-RC4"</span>}})
(add-libs {'<span style="color: #000000;">thi.ng</span>/math {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"0.3.0"</span>}})
(add-libs {'<span style="color: #000000;">thi.ng</span>/ndarray {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"0.3.2"</span>}})
(add-libs {'<span style="color: #000000;">thi.ng</span>/color {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"1.4.0"</span>}})
(add-libs {'<span style="color: #000000;">factual</span>/geo {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"3.0.1"</span>}})
(add-libs {'<span style="color: #000000;">com.github.jai-imageio</span>/jai-imageio-core {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"1.4.0"</span>}})
(add-libs {'<span style="color: #000000;">clj-curl</span>/clj-curl {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"1.1.2"</span>}})
(add-libs {'<span style="color: #000000;">guru.nidi.com.kitfox</span>/svgSalamander {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"1.1.3"</span>}})
(add-libs {'<span style="color: #000000;">batik-rasterize</span>/batik-rasterize {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span> <span style="color: #000000;">"0.1.2"</span>}
           '<span style="color: #000000;">xerces</span>/xerces {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span>  <span style="color: #000000;">"2.4.0"</span>}
           '<span style="color: #000000;">org.apache.xmlgraphics</span>/batik-transcoder {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span>  <span style="color: #000000;">"1.14"</span>}
           '<span style="color: #000000;">org.apache.xmlgraphics</span>/batik-codec {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span>  <span style="color: #000000;">"1.10"</span>}
           '<span style="color: #000000;">org.apache.xmlgraphics</span>/batik-anim {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span>  <span style="color: #000000;">"1.10"</span>}
           '<span style="color: #000000;">org.apache.xmlgraphics</span>/xmlgraphics-commons {<span style="color: #696969;">:</span><span style="color: #000000;">mvn</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #696969;">version</span>  <span style="color: #000000;">"2.3"</span>}})
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8b0000;">;; </span><span style="color: #8b0000;">Add them to the default ~user~ namespace</span>
(require '[clojure.java.io <span style="color: #696969;">:as</span> io]
         '(thi.ng.geom [core <span style="color: #696969;">:as</span> geom]
                       [matrix <span style="color: #696969;">:as</span> matrix])
         '[thi.ng.geom.viz.core <span style="color: #696969;">:as</span> viz]
         '[thi.ng.geom.svg.core <span style="color: #696969;">:as</span> svg]
         '[thi.ng.math.core <span style="color: #696969;">:as</span> math]
         '[thi.ng.ndarray.core <span style="color: #696969;">:as</span> ndarray]
         '[thi.ng.color.core <span style="color: #696969;">:as</span> col]
         '[thi.ng.math.noise <span style="color: #696969;">:as</span> noise]
         '[clj-curl.easy <span style="color: #696969;">:as</span> curl-easy]
         '[clj-curl.opts <span style="color: #696969;">:as</span> curl-opts]
         '[batik.rasterize <span style="color: #696969;">:as</span> batik])
(use 'geo.io)
(use 'geo.jts)
(use '[uncomplicate.neanderthal core native])
</pre>
</div>
</div>
</div>
