climate.org
** SVG Utils
A few helper functions for diplaying things in org
#+BEGIN_SRC clojure
(defn svg2org
  "Takes the SVG hiccup,
      - Serializes it to XML
      - Breaks it up along XML nodes
      - outputs as symbols that can be output to org
    The result can then be exported to HTML"
  [svg-hiccup]
  (-> svg-hiccup
      svg/serialize
      (#(clojure.string/replace %
                                #"><"
                                ">\n<"))
      symbol))

(defn- render-with-svgsalamander
[region
svg-xml-string]
  (let [[lat-range 
         lon-range] (region-ranges region)
        universe (com.kitfox.svg.SVGCache/getSVGUniverse)
        uri (.loadSVG universe
                      (java.io.StringReader. svg-xml-string)
                      "unused-placeholder")
        diagram (.getDiagram universe uri)
        buffered-image (java.awt.image.BufferedImage.
                        (* lon-range
                           100) ;; width
                        (* lat-range
                           100) ;; height
                        java.awt.image.BufferedImage/TYPE_4BYTE_ABGR)
        graphics-2d (.createGraphics buffered-image)]
    (.setRenderingHint graphics-2d
                       java.awt.RenderingHints/KEY_ANTIALIASING
                       java.awt.RenderingHints/VALUE_ANTIALIAS_ON)
    (.render diagram graphics-2d)
    (.removeDocument universe
                     uri)
    buffered-image))

(defn- render-with-batik
[region
svg-xml-string]
(-> svg-xml-string
    (batik/render-svg-string "batik-rendered.png"
                                       {:type :png})))

(defn render-as-buffered-image
  "Given an SVG string, return a native Java BufferedImage
  ie. java.awt.image.BufferedImage"
  [region
   svg-xml-string]
  #_(println svg-xml-string)
  (let [[lat-range 
         lon-range] (region-ranges region)
        universe (com.kitfox.svg.SVGCache/getSVGUniverse)
        uri (.loadSVG universe
                      (java.io.StringReader. svg-xml-string)
                      "unused-placeholder")
        diagram (.getDiagram universe uri)
        buffered-image (java.awt.image.BufferedImage.
                        (* lon-range
                           100) ;; width
                        (* lat-range
                           100) ;; height
                        java.awt.image.BufferedImage/TYPE_4BYTE_ABGR)
        graphics-2d (.createGraphics buffered-image)]
    (.setRenderingHint graphics-2d
                       java.awt.RenderingHints/KEY_ANTIALIASING
                       java.awt.RenderingHints/VALUE_ANTIALIAS_ON)
    (.render diagram graphics-2d)
    (.removeDocument universe
                     uri)
    buffered-image))
#+END_SRC

#+RESULTS:
: #'user/svg2org#'user/render-with-batikclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionSyntax error compiling at (*cider-repl Projects/rocks:localhost:41185(clj)*:19:21).
: Unable to resolve symbol: region-ranges in this context
: Syntax error compiling at (*cider-repl Projects/rocks:localhost:41185(clj)*:54:21).
: Unable to resolve symbol: region-ranges in this context


* Intro
What differentiates the study of atmospheric and ocean circulation from our physics class study of fluid dynamics?

** Primary Driver is Temperature
In a physics class when we look at eddies/vortices in a fluid - they are driven by kinetics and conservation of energy. Turbulence is a mechanical property of the fluid moving around objects

The fundamentally simplifying assumption is that the density of the fluid is a function of the pressure \\
\rho{} = \rho{}(p)

While this holds on the small scale - on the scale of the climate and ocean circulation this assumption quickly falls apart. We need to extend the relationship to include temperature \\
\rho{} = \rho{}(p,T)

In fact temperature is the primary driver behind the dynamics and mixing in the oceans and atmosphere. The warm fluids are more boyant - so they rises and you get convection. This is known as /Geophysical Fluid Dynamics/ (GFD)

** Rotating Sphere
The second distinguishing feature is that we are working on the surface of a spining sphere and the fluids are being compressed gravitationally. The spining is a relevant factor b/c atmospheric and oceanic phenomena are happening on the order of thousands of kilometers - and the radius of the Earth is ~6000km

** Multigas system
At least when it comes to the atmosphere, you have multiple gases working semi-independently. *Dalton's Law of Partal Pressures* tells us that the total pressure of a gas is equal to the sum of the partial pressures of it's constituents.

#+begin_quote
p = p_{d} + e\\
e /partial pressure of water vapor/\\
p_{d} /partial pressure of water vapor/
#+end_quote
For instance most of the heat transfer in the atmosphere is happening thanks to the transfer of energy by moisture. However as a percent-by-volume water vapor is a very small fraction of the atmospheric gas.

The dry air component and vapor component can be treated as both obeying the *perfect gas law*
#+begin_quote
p = \rho{}R_{g}/m_{a} T = \rho{} RT\\
R_[g} = 8.3143 KK^{-1}mol^{-1} .. /universal gas constant/
R = R_{g}/m_{a} = 287Kkg^{-1}K^{-1} .. /for dry air .. where/ m_{a} = 28.97
#+end_quote

The saturation vapor pressure over water is however a function of the temperature following the *Clausius Clapeyron relationship*
#+begin_quote
e_{s} = Ae^{\beta{}T}\\
A = 6.11 hPa\\
\beta{} = 0.067\deg{}C^{-1}
#+end_quote
In summary the amount of water in the atomosphere heavily changes exponentially with the temperature. So warms areas of the Earth have exponentially more moisture (and hence can transport exponentially more heat)
* Global Energy Balance

** The Sun
Emits /3.87 \times{} 10^{26} W/ of power\\

The flux of solar energy at the Earth depends on the Earth-Sun distance /r/ : /S_{0} = Q/4\pi{}r^{2}/. While the distance /r/ varies around 150\times{}10^{9} - it's not by a lot. On average /S_[0}= 1367W/m^{2}/

The Earth's crossectional area is /\pi{}a^{2}/ where /a/ is the radius of the Earth. The total incident solar radiation is  /1.74 \times{} 10^{17}/

