climate.html

<div id="outline-container-org01126ee" class="outline-3">
<h3 id="org01126ee">SVG Utils</h3>
<div class="outline-text-3" id="text-org01126ee">
<p>
A few helper functions for diplaying things in org
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #000000;">defn</span> <span style="color: #000000; background-color: #ffffff;">svg2org</span>
  <span style="color: #8b0000;">"Takes the SVG hiccup,</span>
<span style="color: #8b0000;">      - Serializes it to XML</span>
<span style="color: #8b0000;">      - Breaks it up along XML nodes</span>
<span style="color: #8b0000;">      - outputs as symbols that can be output to org</span>
<span style="color: #8b0000;">    The result can then be exported to HTML"</span>
  [svg-hiccup]
  (<span style="color: #000000;">-&gt;</span> svg-hiccup
      <span style="color: #000000;">svg</span>/serialize
      (#(<span style="color: #000000;">clojure.string</span>/replace <span style="color: #000000;">%</span>
                                #<span style="color: #000000;">"&gt;&lt;"</span>
                                <span style="color: #000000;">"&gt;</span><span style="color: #000000; font-weight: bold;">\n</span><span style="color: #000000;">&lt;"</span>))
      symbol))

(<span style="color: #000000;">defn-</span> <span style="color: #000000; background-color: #ffffff;">render-with-svgsalamander</span>
[region
svg-xml-string]
  (<span style="color: #000000;">let</span> [[lat-range 
         lon-range] (region-ranges region)
        universe (<span style="color: #000000;">com.kitfox.svg.SVGCache</span>/getSVGUniverse)
        uri (.loadSVG universe
                      (java.io.StringReader. svg-xml-string)
                      <span style="color: #000000;">"unused-placeholder"</span>)
        diagram (.getDiagram universe uri)
        buffered-image (java.awt.image.BufferedImage.
                        (* lon-range
                           100) <span style="color: #8b0000;">;; </span><span style="color: #8b0000;">width</span>
                        (* lat-range
                           100) <span style="color: #8b0000;">;; </span><span style="color: #8b0000;">height</span>
                        <span style="color: #000000;">java.awt.image.BufferedImage</span>/TYPE_4BYTE_ABGR)
        graphics-2d (.createGraphics buffered-image)]
    (.setRenderingHint graphics-2d
                       <span style="color: #000000;">java.awt.RenderingHints</span>/KEY_ANTIALIASING
                       <span style="color: #000000;">java.awt.RenderingHints</span>/VALUE_ANTIALIAS_ON)
    (.render diagram graphics-2d)
    (.removeDocument universe
                     uri)
    buffered-image))

(<span style="color: #000000;">defn-</span> <span style="color: #000000; background-color: #ffffff;">render-with-batik</span>
[region
svg-xml-string]
(<span style="color: #000000;">-&gt;</span> svg-xml-string
    (<span style="color: #000000;">batik</span>/render-svg-string <span style="color: #000000;">"batik-rendered.png"</span>
                                       {<span style="color: #696969;">:type</span> <span style="color: #696969;">:png</span>})))

(<span style="color: #000000;">defn</span> <span style="color: #000000; background-color: #ffffff;">render-as-buffered-image</span>
  <span style="color: #8b0000;">"Given an SVG string, return a native Java BufferedImage</span>
<span style="color: #8b0000;">  ie. java.awt.image.BufferedImage"</span>
  [region
   svg-xml-string]
  #_<span style="color: #8b0000;">(println svg-xml-string)</span>
  (<span style="color: #000000;">let</span> [[lat-range 
         lon-range] (region-ranges region)
        universe (<span style="color: #000000;">com.kitfox.svg.SVGCache</span>/getSVGUniverse)
        uri (.loadSVG universe
                      (java.io.StringReader. svg-xml-string)
                      <span style="color: #000000;">"unused-placeholder"</span>)
        diagram (.getDiagram universe uri)
        buffered-image (java.awt.image.BufferedImage.
                        (* lon-range
                           100) <span style="color: #8b0000;">;; </span><span style="color: #8b0000;">width</span>
                        (* lat-range
                           100) <span style="color: #8b0000;">;; </span><span style="color: #8b0000;">height</span>
                        <span style="color: #000000;">java.awt.image.BufferedImage</span>/TYPE_4BYTE_ABGR)
        graphics-2d (.createGraphics buffered-image)]
    (.setRenderingHint graphics-2d
                       <span style="color: #000000;">java.awt.RenderingHints</span>/KEY_ANTIALIASING
                       <span style="color: #000000;">java.awt.RenderingHints</span>/VALUE_ANTIALIAS_ON)
    (.render diagram graphics-2d)
    (.removeDocument universe
                     uri)
    buffered-image))
</pre>
</div>

<pre class="example">
#'user/svg2org#'user/render-with-batikclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionSyntax error compiling at (*cider-repl Projects/rocks:localhost:41185(clj)*:19:21).
Unable to resolve symbol: region-ranges in this context
Syntax error compiling at (*cider-repl Projects/rocks:localhost:41185(clj)*:54:21).
Unable to resolve symbol: region-ranges in this context
</pre>
</div>
</div>
</div>


<div id="outline-container-org59b315b" class="outline-2">
<h2 id="org59b315b">Intro</h2>
<div class="outline-text-2" id="text-org59b315b">
<p>
What differentiates the study of atmospheric and ocean circulation from our physics class study of fluid dynamics?
</p>
</div>

<div id="outline-container-org14db3e3" class="outline-3">
<h3 id="org14db3e3">Primary Driver is Temperature</h3>
<div class="outline-text-3" id="text-org14db3e3">
<p>
In a physics class when we look at eddies/vortices in a fluid - they are driven by kinetics and conservation of energy. Turbulence is a mechanical property of the fluid moving around objects
</p>

<p>
The fundamentally simplifying assumption is that the density of the fluid is a function of the pressure <br>
&rho; = &rho;(p)
</p>

<p>
While this holds on the small scale - on the scale of the climate and ocean circulation this assumption quickly falls apart. We need to extend the relationship to include temperature <br>
&rho; = &rho;(p,T)
</p>

<p>
In fact temperature is the primary driver behind the dynamics and mixing in the oceans and atmosphere. The warm fluids are more boyant - so they rises and you get convection. This is known as <i>Geophysical Fluid Dynamics</i> (GFD)
</p>
</div>
</div>

<div id="outline-container-org94e6f68" class="outline-3">
<h3 id="org94e6f68">Rotating Sphere</h3>
<div class="outline-text-3" id="text-org94e6f68">
<p>
The second distinguishing feature is that we are working on the surface of a spining sphere and the fluids are being compressed gravitationally. The spining is a relevant factor b/c atmospheric and oceanic phenomena are happening on the order of thousands of kilometers - and the radius of the Earth is ~6000km
</p>
</div>
</div>

<div id="outline-container-orgb510327" class="outline-3">
<h3 id="orgb510327">Multigas system</h3>
<div class="outline-text-3" id="text-orgb510327">
<p>
At least when it comes to the atmosphere, you have multiple gases working semi-independently. <b>Dalton's Law of Partal Pressures</b> tells us that the total pressure of a gas is equal to the sum of the partial pressures of it's constituents.
</p>

<blockquote>
<p>
p = p<sub>d</sub> + e<br>
e <i>partial pressure of water vapor</i><br>
p<sub>d</sub> <i>partial pressure of water vapor</i>
</p>
</blockquote>
<p>
For instance most of the heat transfer in the atmosphere is happening thanks to the transfer of energy by moisture. However as a percent-by-volume water vapor is a very small fraction of the atmospheric gas.
</p>

<p>
The dry air component and vapor component can be treated as both obeying the <b>perfect gas law</b>
</p>
<blockquote>
<p>
p = &rho;R<sub>g</sub>/m<sub>a</sub> T = &rho; RT<br>
R_[g} = 8.3143 KK<sup>-1</sup>mol<sup>-1</sup> .. <i>universal gas constant</i>
R = R<sub>g</sub>/m<sub>a</sub> = 287Kkg<sup>-1</sup>K<sup>-1</sup> .. <i>for dry air .. where</i> m<sub>a</sub> = 28.97
</p>
</blockquote>

<p>
The saturation vapor pressure over water is however a function of the temperature following the <b>Clausius Clapeyron relationship</b>
</p>
<blockquote>
<p>
e<sub>s</sub> = Ae<sup>&beta;T</sup><br>
A = 6.11 hPa<br>
&beta; = 0.067&deg;C<sup>-1</sup>
</p>
</blockquote>
<p>
In summary the amount of water in the atomosphere heavily changes exponentially with the temperature. So warms areas of the Earth have exponentially more moisture (and hence can transport exponentially more heat)
</p>
</div>
</div>
</div>
<div id="outline-container-org465ec91" class="outline-2">
<h2 id="org465ec91">Global Energy Balance</h2>
<div class="outline-text-2" id="text-org465ec91">
</div>
<div id="outline-container-org0f92ee9" class="outline-3">
<h3 id="org0f92ee9">The Sun</h3>
<div class="outline-text-3" id="text-org0f92ee9">
<p>
Emits <i>3.87 &times; 10<sup>26</sup> W</i> of power<br>
</p>

<p>
The flux of solar energy at the Earth depends on the Earth-Sun distance <i>r</i> : <i>S<sub>0</sub> = Q/4&pi;r<sup>2</sup></i>. While the distance <i>r</i> varies around 150&times;10<sup>9</sup> - it's not by a lot. On average <i>S_[0}= 1367W/m<sup>2</sup></i>
</p>

<p>
The Earth's crossectional area is <i>&pi;a<sup>2</sup></i> where <i>a</i> is the radius of the Earth. The total incident solar radiation is  <i>1.74 &times; 10<sup>17</sup></i>
</p>
</div>
</div>
