climate.org
** Solar Flux
This strikes the disk of the Earth for a total of /S_{0}\pi{}a^{2}/ W. But it then reradiates out over the whole surface of the sphere of the Earth - /4\pi{}a^{2}/.

At equilibrium the Earth on average naturally reradiates as much as strikes it (otherwise it'd get colder and colder or hotter and hotter over time). The average *solar flux* per unit area is then

#+begin_quote
(S_{0}\pi{}a^{2})/(4\pi{}a^{2})\\
S_{0}/4
#+end_quote


** Albedo

A fraction of this incoming energy is reflected away (the albedo) - depending on the surface type. Expressed as a percentage

- Ocean 2-10%
- Forest 6-18 %
- Soil 10-20 %
- Desert 35-45 %
- Snow 40-95%

On average it's about 30% (the *planetary albedo* - /\alpha{}/). So the total energy absorption of Earth will be:

#+begin_quote
(1-\alpha{})\times{}S_{0}\pi{}a^{2} \\
(1-0.3)* 1.74 \times{} 10^{17} \\
1.22 \times{} 10^{17} W
#+end_quote

** Black body radiation
The Earth is at some temperature /T_{e}/. The Stefan-Boltzmann law tells us about how much a black body emits at a given temperature
#+begin_quote
*Stefan-Boltzmann law*\\
\sigma{}T_{e}^{4}\\
/where/ \sigma{} = 5.67 \times{} 10^{-8} Wm^{-2}K^{-4}
#+end_quote

We treat the the Earth is a sphere radiating out equally in all directions giving a total radiation emitted as  /4\pi{}a^{2}\sigma{}T_{e}^{4}/

However, at equilibrium the Earth must radiate as much energy as it absorbs (otherwise it would keep building up heat or cold). So /1.22 \times{} 10^{17} W/ must radiate out. Combing the radiation equation with the total we can solve for the Earth's *emission temperature* /T_{e}/

/T_{e} = [ S_{0}(1-\alpha{}) / 4\sigma{} ]^{1/4} = 255K/

*Wein's displacement law* gives us a handy tool to find the blackbody radiation peak wavelength
#+begin_quote
*Wein's Displacement Law*
\lambda{}_{m}T = /constant/
#+end_quote
So for instance b/c the sun has en emission peak of 14\micro{}m and a temp of 6000K. Then the Earth at  temperature of 255K has en emission of /0.6\micro{}m \times{} 6000/255 = 14\micro{}m/. This is very much in the infrared and doesn't overlap with the sun' emission much at all

** Greenhouse effect
The atmosphere however is pretty opaque to IR so the Earth's black body gets absorbed in large part (primarily by H_{2}O) and reradiated at altitude .. at around 5km (above this there is little moisture). So the Earth's "emission temperature" /T_{e}/ is really the temperature of the atmosphere at 5km. This emission goes both outwards towards space, and downward back to the ground - making the ground warmer (than if there was no atmosphere at all)

*** Simply opaque model

The simplest greenhouse models is to assume all of the incoming light from the sun strikes the Earth. And all of the Earth's black body IR radiation is absorbed by the atmosphere. 

#+begin_quote
- T_{s} :: temperature of the surface of Earth
- T_{a} :: temperature of the atmosphere (that then re-radiated out to space)
#+end_quote

Since from the outside you'd only see the radiation of the atmosphere, the Earth's emission temperature must equal to the atmospheric emission temperature /T_{e} == T_{a}/. Furthermore, the incoming absorbed *solar flux* must equal to the energy emitted by the planet. However since the atmosphere is opaque, it's the only emitter, hence /(1-\alpha{})S_{0}/4 = \sigma{}T_{a}^{4}/ . 

The atmosphere is emitting this /\sigma{}T_{a}^{4}/ - both up and down. The downward component will heat the surface along with mentioned *solar flux* (scaled by the albedo factor /(1-\alpha{})/)

Since 
#+begin_quote
\sigma{}T_{a}^{4} + (1-\alpha{})S_{0}/4
#+end_quote

And the Earth's surface in turn will reradiate out this energy as black body radiation /\sigma{}T_{s}^{4}/. Hence

#+begin_quote
\sigma{}T_{a}^{4} = \sigma{}T_{a}^{4} + (1-\alpha{})S_{0}/4
#+end_quote

Since the atmosphere's emitted flux is equal to the incoming radiation we can subsitute and solve

#+begin_quote
\sigma{}T_{a}^{4} = \sigma{}T_{a}^{4} + \sigma{}T_{a}^{4} \\
\sigma{}T_{a}^{4} = 2\sigma{}T_{a}^{4} \\
T_{s} = 2^{1/4}T_{a}
#+end_quote


We already calculated the Earth's emission temperature /T_{e}/ as 255K, and in the opaque model this is equal to the atmosphere temperature - hence /T_{s}= 255\times{}2^{1/4} = 303K/

*** Leaky model

In reality the atmosphere doesn't block all the black body radiation coming off the surface. So the outgoing energy is both coming from the heat of the atmosphere and some of the blackbody radiation off the surface. It still sums to the total absorbed incoming radiation from the sun - /(1-\alpha{})S_{0}/4/. Note that when the atmosphere absorbs a fraction /\epsilon{}/ of the IR coming from the surface then it also emits this same fraction
#+begin_quote
*Kirchhoff's law*\\
Radiation_{atmospheric} = \epsilon{}\sigma{}T_{a}^{4}
#+end_quote

, then we are left with the sum for the top of the atmosphere
#+begin_quote
(1-\alpha{})S_{0}/4 = Radiation_{atmospheric} + Radiation_{from-surface-through-atmosphere}\\
(1-\alpha{})S_{0}/4 = \epsilon{}\sigma{}T_{a}^{4} + (1-\epsilon{})\sigma{}T_{s}^{4}
#+end_quote
Again at the surface you have the second contraint - net zero energy. The incoming solar radiation and downward atmospheric radiation equal the resulting surface radiation. (note the last term is slightly different)
#+begin_quote
(1-\alpha{})S_{0}/4 + Radiation_{atmospheric} = Radiation_{total-from-surface}\\
(1-\alpha{})S_{0}/4 + \epsilon{}\sigma{}T_{a}^{4} = \sigma{}T_{s}^{4}
#+end_quote

Combining the two constraints we get
#+begin_quote
\epsilon{}\sigma{}T_{a}^{4} + (1-\epsilon{})\sigma{}T_{s}^{4} = \sigma{}T_{s}^{4} - \sigma{}T_{a}^{4} \\
\epsilon{}T_{a}^{4} + (1-\epsilon{})T_{s}^{4} = T_{s}^{4} - T_{a}^{4} \\
2\epsilon{}T_{a}^{4} = \epsilon{}T_{s}^{4} \\
\epsilon{}T_{a}^{4} = \epsilon{}T_{s}^{4}/2 \\
T_{a} = T_{s}^{4}/2 \\
T_{a} = (1/2)^{1/4} T_{s}
#+end_quote

So T_{a} < T_{s} - always! And indepent of /\epsilon{}/

And in terms of the incoming raditation
#+begin_quote
(1-\alpha{})S_{0}/4 = \epsilon{}\sigma{}T_{a}^{4} + (1-\epsilon{})\sigma{}T_{s}^{4} \\
(1-\alpha{})S_{0}/4 = \epsilon{}\sigma{}[(1/2)^{1/4} T_{s}]^{4} + (1-\epsilon{})\sigma{}T_{s}^{4}\\
(1-\alpha{})S_{0}/4 = \epsilon{}\sigma{}(1/2)T_{s}^{4} + (1-\epsilon{})\sigma{}T_{s}^{4} \\
(1-\alpha{})S_{0}/4 = [ (\epsilon{}/2)+ 2/2 -2\epsilon{}/2) ] \sigma{}T_{s}^{4} \\
(1-\alpha{})S_{0}/4 = [ (2-\epsilon{})/2 ] \sigma{}T_{s}^{4} \\
#+end_quote

*** Feedback

While these models are very simplified b/c it's more accurate to say there are many layers and a lot of heat transfer happens due to dynamic convection (and not this radiation) - they do give us a general relationship

