climate.html

<div id="outline-container-org096015d" class="outline-3">
<h3 id="org096015d">Solar Flux</h3>
<div class="outline-text-3" id="text-org096015d">
<p>
This strikes the disk of the Earth for a total of <i>S<sub>0</sub>&pi;a<sup>2</sup></i> W. But it then reradiates out over the whole surface of the sphere of the Earth - <i>4&pi;a<sup>2</sup></i>.
</p>

<p>
At equilibrium the Earth on average naturally reradiates as much as strikes it (otherwise it'd get colder and colder or hotter and hotter over time). The average <b>solar flux</b> per unit area is then
</p>

<blockquote>
<p>
(S<sub>0</sub>&pi;a<sup>2</sup>)/(4&pi;a<sup>2</sup>)<br>
S<sub>0</sub>/4
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org10caee8" class="outline-3">
<h3 id="org10caee8">Albedo</h3>
<div class="outline-text-3" id="text-org10caee8">
<p>
A fraction of this incoming energy is reflected away (the albedo) - depending on the surface type. Expressed as a percentage
</p>

<ul class="org-ul">
<li>Ocean 2-10%</li>
<li>Forest 6-18 %</li>
<li>Soil 10-20 %</li>
<li>Desert 35-45 %</li>
<li>Snow 40-95%</li>
</ul>

<p>
On average it's about 30% (the <b>planetary albedo</b> - <i>&alpha;</i>). So the total energy absorption of Earth will be:
</p>

<blockquote>
<p>
(1-&alpha;)&times;S<sub>0</sub>&pi;a<sup>2</sup> <br>
(1-0.3)* 1.74 &times; 10<sup>17</sup> <br>
1.22 &times; 10<sup>17</sup> W
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org2b30d4c" class="outline-3">
<h3 id="org2b30d4c">Black body radiation</h3>
<div class="outline-text-3" id="text-org2b30d4c">
<p>
The Earth is at some temperature <i>T<sub>e</sub></i>. The Stefan-Boltzmann law tells us about how much a black body emits at a given temperature
</p>
<blockquote>
<p>
<b>Stefan-Boltzmann law</b><br>
&sigma;T<sub>e</sub><sup>4</sup><br>
<i>where</i> &sigma; = 5.67 &times; 10<sup>-8</sup> Wm<sup>-2</sup>K<sup>-4</sup>
</p>
</blockquote>

<p>
We treat the the Earth is a sphere radiating out equally in all directions giving a total radiation emitted as  <i>4&pi;a<sup>2</sup>&sigma;T<sub>e</sub><sup>4</sup></i>
</p>

<p>
However, at equilibrium the Earth must radiate as much energy as it absorbs (otherwise it would keep building up heat or cold). So <i>1.22 &times; 10<sup>17</sup> W</i> must radiate out. Combing the radiation equation with the total we can solve for the Earth's <b>emission temperature</b> <i>T<sub>e</sub></i>
</p>

<p>
<i>T<sub>e</sub> = [ S<sub>0</sub>(1-&alpha;) / 4&sigma; ]<sup>1/4</sup> = 255K</i>
</p>

<p>
<b>Wein's displacement law</b> gives us a handy tool to find the blackbody radiation peak wavelength
</p>
<blockquote>
<p>
<b>Wein's Displacement Law</b>
&lambda;<sub>m</sub>T = <i>constant</i>
</p>
</blockquote>
<p>
So for instance b/c the sun has en emission peak of 14&micro;m and a temp of 6000K. Then the Earth at  temperature of 255K has en emission of <i>0.6&micro;m &times; 6000/255 = 14&micro;m</i>. This is very much in the infrared and doesn't overlap with the sun' emission much at all
</p>
</div>
</div>

<div id="outline-container-org7064aec" class="outline-3">
<h3 id="org7064aec">Greenhouse effect</h3>
<div class="outline-text-3" id="text-org7064aec">
<p>
The atmosphere however is pretty opaque to IR so the Earth's black body gets absorbed in large part (primarily by H<sub>2</sub>O) and reradiated at altitude .. at around 5km (above this there is little moisture). So the Earth's "emission temperature" <i>T<sub>e</sub></i> is really the temperature of the atmosphere at 5km. This emission goes both outwards towards space, and downward back to the ground - making the ground warmer (than if there was no atmosphere at all)
</p>
</div>

<div id="outline-container-org485d81f" class="outline-4">
<h4 id="org485d81f">Simply opaque model</h4>
<div class="outline-text-4" id="text-org485d81f">
<p>
The simplest greenhouse models is to assume all of the incoming light from the sun strikes the Earth. And all of the Earth's black body IR radiation is absorbed by the atmosphere. 
</p>

<blockquote>
<dl class="org-dl">
<dt>T<sub>s</sub></dt><dd>temperature of the surface of Earth</dd>
<dt>T<sub>a</sub></dt><dd>temperature of the atmosphere (that then re-radiated out to space)</dd>
</dl>
</blockquote>

<p>
Since from the outside you'd only see the radiation of the atmosphere, the Earth's emission temperature must equal to the atmospheric emission temperature <i>T<sub>e</sub> == T<sub>a</sub></i>. Furthermore, the incoming absorbed <b>solar flux</b> must equal to the energy emitted by the planet. However since the atmosphere is opaque, it's the only emitter, hence <i>(1-&alpha;)S<sub>0</sub>/4 = &sigma;T<sub>a</sub><sup>4</sup></i> . 
</p>

<p>
The atmosphere is emitting this <i>&sigma;T<sub>a</sub><sup>4</sup></i> - both up and down. The downward component will heat the surface along with mentioned <b>solar flux</b> (scaled by the albedo factor <i>(1-&alpha;)</i>)
</p>

<p>
Since 
</p>
<blockquote>
<p>
&sigma;T<sub>a</sub><sup>4</sup> + (1-&alpha;)S<sub>0</sub>/4
</p>
</blockquote>

<p>
And the Earth's surface in turn will reradiate out this energy as black body radiation <i>&sigma;T<sub>s</sub><sup>4</sup></i>. Hence
</p>

<blockquote>
<p>
&sigma;T<sub>a</sub><sup>4</sup> = &sigma;T<sub>a</sub><sup>4</sup> + (1-&alpha;)S<sub>0</sub>/4
</p>
</blockquote>

<p>
Since the atmosphere's emitted flux is equal to the incoming radiation we can subsitute and solve
</p>

<blockquote>
<p>
&sigma;T<sub>a</sub><sup>4</sup> = &sigma;T<sub>a</sub><sup>4</sup> + &sigma;T<sub>a</sub><sup>4</sup> <br>
&sigma;T<sub>a</sub><sup>4</sup> = 2&sigma;T<sub>a</sub><sup>4</sup> <br>
T<sub>s</sub> = 2<sup>1/4</sup>T<sub>a</sub>
</p>
</blockquote>


<p>
We already calculated the Earth's emission temperature <i>T<sub>e</sub></i> as 255K, and in the opaque model this is equal to the atmosphere temperature - hence <i>T<sub>s</sub>= 255&times;2<sup>1/4</sup> = 303K</i>
</p>
</div>
</div>

<div id="outline-container-org5c9b66a" class="outline-4">
<h4 id="org5c9b66a">Leaky model</h4>
<div class="outline-text-4" id="text-org5c9b66a">
<p>
In reality the atmosphere doesn't block all the black body radiation coming off the surface. So the outgoing energy is both coming from the heat of the atmosphere and some of the blackbody radiation off the surface. It still sums to the total absorbed incoming radiation from the sun - <i>(1-&alpha;)S<sub>0</sub>/4</i>. Note that when the atmosphere absorbs a fraction <i>&epsilon;</i> of the IR coming from the surface then it also emits this same fraction
</p>
<blockquote>
<p>
<b>Kirchhoff's law</b><br>
Radiation<sub>atmospheric</sub> = &epsilon;&sigma;T<sub>a</sub><sup>4</sup>
</p>
</blockquote>

<p>
, then we are left with the sum for the top of the atmosphere
</p>
<blockquote>
<p>
(1-&alpha;)S<sub>0</sub>/4 = Radiation<sub>atmospheric</sub> + Radiation<sub>from-surface-through-atmosphere</sub><br>
(1-&alpha;)S<sub>0</sub>/4 = &epsilon;&sigma;T<sub>a</sub><sup>4</sup> + (1-&epsilon;)&sigma;T<sub>s</sub><sup>4</sup>
</p>
</blockquote>
<p>
Again at the surface you have the second contraint - net zero energy. The incoming solar radiation and downward atmospheric radiation equal the resulting surface radiation. (note the last term is slightly different)
</p>
<blockquote>
<p>
(1-&alpha;)S<sub>0</sub>/4 + Radiation<sub>atmospheric</sub> = Radiation<sub>total-from-surface</sub><br>
(1-&alpha;)S<sub>0</sub>/4 + &epsilon;&sigma;T<sub>a</sub><sup>4</sup> = &sigma;T<sub>s</sub><sup>4</sup>
</p>
</blockquote>

<p>
Combining the two constraints we get
</p>
<blockquote>
<p>
&epsilon;&sigma;T<sub>a</sub><sup>4</sup> + (1-&epsilon;)&sigma;T<sub>s</sub><sup>4</sup> = &sigma;T<sub>s</sub><sup>4</sup> - &sigma;T<sub>a</sub><sup>4</sup> <br>
&epsilon;T<sub>a</sub><sup>4</sup> + (1-&epsilon;)T<sub>s</sub><sup>4</sup> = T<sub>s</sub><sup>4</sup> - T<sub>a</sub><sup>4</sup> <br>
2&epsilon;T<sub>a</sub><sup>4</sup> = &epsilon;T<sub>s</sub><sup>4</sup> <br>
&epsilon;T<sub>a</sub><sup>4</sup> = &epsilon;T<sub>s</sub><sup>4</sup>/2 <br>
T<sub>a</sub> = T<sub>s</sub><sup>4</sup>/2 <br>
T<sub>a</sub> = (1/2)<sup>1/4</sup> T<sub>s</sub>
</p>
</blockquote>

<p>
So T<sub>a</sub> &lt; T<sub>s</sub> - always! And indepent of <i>&epsilon;</i>
</p>

<p>
And in terms of the incoming raditation
</p>
<blockquote>
<p>
(1-&alpha;)S<sub>0</sub>/4 = &epsilon;&sigma;T<sub>a</sub><sup>4</sup> + (1-&epsilon;)&sigma;T<sub>s</sub><sup>4</sup> <br>
(1-&alpha;)S<sub>0</sub>/4 = &epsilon;&sigma;[(1/2)<sup>1/4</sup> T<sub>s</sub>]<sup>4</sup> + (1-&epsilon;)&sigma;T<sub>s</sub><sup>4</sup><br>
(1-&alpha;)S<sub>0</sub>/4 = &epsilon;&sigma;(1/2)T<sub>s</sub><sup>4</sup> + (1-&epsilon;)&sigma;T<sub>s</sub><sup>4</sup> <br>
(1-&alpha;)S<sub>0</sub>/4 = [ (&epsilon;/2)+ 2/2 -2&epsilon;/2) ] &sigma;T<sub>s</sub><sup>4</sup> <br>
(1-&alpha;)S<sub>0</sub>/4 = [ (2-&epsilon;)/2 ] &sigma;T<sub>s</sub><sup>4</sup> <br>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgf6f12ce" class="outline-4">
<h4 id="orgf6f12ce">Feedback</h4>
<div class="outline-text-4" id="text-orgf6f12ce">
<p>
While these models are very simplified b/c it's more accurate to say there are many layers and a lot of heat transfer happens due to dynamic convection (and not this radiation) - they do give us a general relationship
</p>
</div>
</div>
</div>
</div>
