climate.org
* Vertical Structure

** Layers

The top of the atomosphere is the *thermosphere*. This region is very short wavelength UV. At the outer reaches the UV is high enough energy to cause /photoionization/ which creates the *ionosphere*.  Other short wave UV is absorbed by /O_{2}/ superheating the air up to as much as 2000C. The air here doesn't really behave like a normal gas b/c it's so thin. As this short wave UV is absorbed the effect diminishes and there is a temperature minimum known as the *mesopause*. 

The ionization of /photolysis/ can break O_{2} bonds and will generate ozone, O_{3},  at these high level. And this ozone is then found at higher and higher partial pressure going down. Ozone absorbs longer wave UV - leading to hotter and hotter temperatures going downward. This reaches a new maximum at the *stratopause*. Note that this absorption maximum doesn't occur at the actual ozone maximum. The partial pressure of ozone reaches a maximum much lower, but b/c by the ozone maximum most of the UV has already been absorbed the temperature maximum is much higher up.

Nonetheless, this zone with still-absorbing ozone forms a huge layer called the *stratosphere*. It shields the surface from harmful ionizing radiation. It also is very stratified and doesn't mix much. Particles ejected into it will have long residence times (ex: from volcanoes)

The ozone heating reach a minimum at the *tropopause* and below this we have the *troposphere* - which contains 85% of the mass of the atmosphere and almost all water vapor (the primary greenhouse gas). The moisture is really mostly in the lower bounds as it's very temperature sensitive (due to the /Clausius Clayperon relationship/). Using the previous radiative equilibrium profile for this area would give a very wrong temperature profile b/c this area is strongly controlled by convections

** Pressure

If you look at a static slice of a cylinder of air. It's not moving up or down and hence it's in equilibrium and the net force on the cylinder must be zero. 
#+begin_quote
- Gravity on the block of air :: -gM = -g\rho{}\delta{}A\delta{}z
- Pressure on top surface :: p(z + \delta{}z) \rightarrow{} p(z) + \delta{}p \rightarrow{} -(p(z) + \delta{}\rho{}) \delta{}A
- Pressure on bottom surface :: p(z)\delta{}A\\
/These add up to zero/\\
0 = -g\rho{}\delta{}A\delta{}z - (p(z) + \delta{}\rho{}) \delta{}A + p(z)\delta{}A\\
0 = \partial{}p/\partial{}z + g\rho{}
#+end_quote
This is the equation of *hydrostatic balance*. From the /perfect gas law/ we know that
#+begin_quote
p = \rho{}RT(z) \\
\partial{}p/\partial{}z = -gp/RT(z)' \\
\partial{}p/\partial{}zp = -g/RT(z)' \\
\partial{}\ln{}p/\partial{}z = -g/RT(z)' .. /b/c/ \partial{}x/x = \partial{}ln(x) \\
\partial{}\ln{}p = -\partial{}zg/RT(z)' \\
/integrate both sides/
\ln{}p =  \int{}_{0}^{z}\partial{}z'g/RT(z') + constant \\
p(z) = p_{s}exp(-\int{}_{0}^{z} dz'g/RT(z'))
#+end_quote
If you assume a constant temperature /T(z) = T_{0}/ then this simplifies to an exponential /p(z)=p_{s}e^{-zg/RT_{0}}/ . Often this simplifying assumption is okay.

You can reuse the ideal gas law to reexpress these in terms of changes of density
#+begin_quote
- Constant T - T_{0} :: 
\rho{}(z) = [p_{s}/RT_{0}] e^{-zg/RT_{0}}
- Variable T - T(z) :: 
\rho{}(z) = [p_{s}/RT(z)] e^{-\int{}_{0}^{2}-dz'g/RT(z)}
#+end_quote
A consequence of these two relationships is that most of the atmospheric mass is at the very bottom - near the surface
 
* Convection
If you have a dense layer above a less dense one then you have an unstable setup where you will sometimes get convection. Convection in incompressibly fluids (like the ocean) is simpler than in a compressible like the air.

** In Water
We start with the simpler incompressible case. We look at a small chunk of water. It is getting pulled downward by gravity but also being pushed up by the parcel below it. Its buoyancy is:
#+begin_quote
b = -g(\rho{}_{p} - \rho{}_e{})/\rho_{p}\\ /.. page 34. Unclear how this is derived!/
#+end_quote
If /\rho{}_{p} < \rho{}_e{}/ then it's positively boyant and rises, otherwise it's negatively boyant and sinks.

An easier way to look at the movement of the parcel is look at the potential energy ( /U = mvh/ ). Imagine it exchanging positions with another parcel below it. At the start their cumulative energies will be 
#+begin_quote
PE_{initial} = g\rho{}_{1}z_{1} + g\rho{}_{2}z_{2}\\
PE_{initial} = g(\rho{}_{1}z_{1} + \rho{}_{2}z_{2})
#+end_quote
If they exchange positions then the energy becomes
#+begin_quote
PE_{new} = g(\rho{}_{1}z_{2} + \rho{}_{2}z_{1})
#+end_quote
If the change in energy is positive then some of the potential energy has converted to kinetic and the parcels will exchange. Otherwise they won't
#+begin_quote
PE_{new} - PE_{initial} = -g(\rho{}_{1}z_{2} + \rho{}_{2}z_{1} - \rho{}_{1}z_{1} - \rho{}_{2}z_{2})\\
PE_{new} - PE_{initial} = -g(\rho{}_{2} - \rho{}_{1})(z_{2} - z_{1})\\
#+end_quote
We can rewrite this in terms of the density gradient /d\rho{}/dz/ (ie. how fast the density is changing)
#+begin_quote
/since../\\
d\rho{}/dz = (\rho{}_{2} - \rho{}_{1})/(z_{2} - z_{1})\\
PE_{new} - PE_{initial} = -g(d\rho{}/dz)(z_{2} - z_{2})^{2}\\
#+end_quote
So as long as the density gradient is positive, potential energy will turn to kinetic and you get convective flow

