climate.html

<div id="outline-container-org476d48e" class="outline-2">
<h2 id="org476d48e">Vertical Structure</h2>
<div class="outline-text-2" id="text-org476d48e">
</div>
<div id="outline-container-org76240fa" class="outline-3">
<h3 id="org76240fa">Layers</h3>
<div class="outline-text-3" id="text-org76240fa">
<p>
The top of the atomosphere is the <b>thermosphere</b>. This region is very short wavelength UV. At the outer reaches the UV is high enough energy to cause <i>photoionization</i> which creates the <b>ionosphere</b>.  Other short wave UV is absorbed by <i>O<sub>2</sub></i> superheating the air up to as much as 2000C. The air here doesn't really behave like a normal gas b/c it's so thin. As this short wave UV is absorbed the effect diminishes and there is a temperature minimum known as the <b>mesopause</b>. 
</p>

<p>
The ionization of <i>photolysis</i> can break O<sub>2</sub> bonds and will generate ozone, O<sub>3</sub>,  at these high level. And this ozone is then found at higher and higher partial pressure going down. Ozone absorbs longer wave UV - leading to hotter and hotter temperatures going downward. This reaches a new maximum at the <b>stratopause</b>. Note that this absorption maximum doesn't occur at the actual ozone maximum. The partial pressure of ozone reaches a maximum much lower, but b/c by the ozone maximum most of the UV has already been absorbed the temperature maximum is much higher up.
</p>

<p>
Nonetheless, this zone with still-absorbing ozone forms a huge layer called the <b>stratosphere</b>. It shields the surface from harmful ionizing radiation. It also is very stratified and doesn't mix much. Particles ejected into it will have long residence times (ex: from volcanoes)
</p>

<p>
The ozone heating reach a minimum at the <b>tropopause</b> and below this we have the <b>troposphere</b> - which contains 85% of the mass of the atmosphere and almost all water vapor (the primary greenhouse gas). The moisture is really mostly in the lower bounds as it's very temperature sensitive (due to the <i>Clausius Clayperon relationship</i>). Using the previous radiative equilibrium profile for this area would give a very wrong temperature profile b/c this area is strongly controlled by convections
</p>
</div>
</div>

<div id="outline-container-orga111b73" class="outline-3">
<h3 id="orga111b73">Pressure</h3>
<div class="outline-text-3" id="text-orga111b73">
<p>
If you look at a static slice of a cylinder of air. It's not moving up or down and hence it's in equilibrium and the net force on the cylinder must be zero. 
</p>
<blockquote>
<dl class="org-dl">
<dt>Gravity on the block of air</dt><dd>-gM = -g&rho;&delta;A&delta;z</dd>
<dt>Pressure on top surface</dt><dd>p(z + &delta;z) &rarr; p(z) + &delta;p &rarr; -(p(z) + &delta;&rho;) &delta;A</dd>
<dt>Pressure on bottom surface</dt><dd>p(z)&delta;A<br></dd>
</dl>
<p>
<i>These add up to zero</i><br>
0 = -g&rho;&delta;A&delta;z - (p(z) + &delta;&rho;) &delta;A + p(z)&delta;A<br>
0 = &part;p/&part;z + g&rho;
</p>
</blockquote>
<p>
This is the equation of <b>hydrostatic balance</b>. From the <i>perfect gas law</i> we know that
</p>
<blockquote>
<p>
p = &rho;RT(z) <br>
&part;p/&part;z = -gp/RT(z)' <br>
&part;p/&part;zp = -g/RT(z)' <br>
&part;lnp/&part;z = -g/RT(z)' .. <i>b/c</i> &part;x/x = &part;ln(x) <br>
&part;lnp = -&part;zg/RT(z)' <br>
<i>integrate both sides</i>
lnp =  &int;<sub>0</sub><sup>z</sup>&part;z'g/RT(z') + constant <br>
p(z) = p<sub>s</sub>exp(-&int;<sub>0</sub><sup>z</sup> dz'g/RT(z'))
</p>
</blockquote>
<p>
If you assume a constant temperature <i>T(z) = T<sub>0</sub></i> then this simplifies to an exponential <i>p(z)=p<sub>s</sub>e<sup>-zg/RT<sub>0</sub></sup></i> . Often this simplifying assumption is okay.
</p>

<p>
You can reuse the ideal gas law to reexpress these in terms of changes of density
</p>
<blockquote>
<dl class="org-dl">
<dt>Constant T - T<sub>0</sub></dt><dd></dd>
</dl>
<p>
&rho;(z) = [p<sub>s</sub>/RT<sub>0</sub>] e<sup>-zg/RT<sub>0</sub></sup>
</p>
<dl class="org-dl">
<dt>Variable T - T(z)</dt><dd></dd>
</dl>
<p>
&rho;(z) = [p<sub>s</sub>/RT(z)] e<sup>-&int;<sub>0</sub><sup>2</sup>-dz'g/RT(z)</sup>
</p>
</blockquote>
<p>
A consequence of these two relationships is that most of the atmospheric mass is at the very bottom - near the surface
</p>
</div>
</div>
</div>

<div id="outline-container-org949bc77" class="outline-2">
<h2 id="org949bc77">Convection</h2>
<div class="outline-text-2" id="text-org949bc77">
<p>
If you have a dense layer above a less dense one then you have an unstable setup where you will sometimes get convection. Convection in incompressibly fluids (like the ocean) is simpler than in a compressible like the air.
</p>
</div>

<div id="outline-container-org215a9da" class="outline-3">
<h3 id="org215a9da">In Water</h3>
<div class="outline-text-3" id="text-org215a9da">
<p>
We start with the simpler incompressible case. We look at a small chunk of water. It is getting pulled downward by gravity but also being pushed up by the parcel below it. Its buoyancy is:
</p>
<blockquote>
<p>
b = -g(&rho;<sub>p</sub> - &rho;<sub>e</sub>{})/&rho;<sub>p</sub>\\ <i>.. page 34. Unclear how this is derived!</i>
</p>
</blockquote>
<p>
If <i>&rho;<sub>p</sub> &lt; &rho;<sub>e</sub>{}</i> then it's positively boyant and rises, otherwise it's negatively boyant and sinks.
</p>

<p>
An easier way to look at the movement of the parcel is look at the potential energy ( <i>U = mvh</i> ). Imagine it exchanging positions with another parcel below it. At the start their cumulative energies will be 
</p>
<blockquote>
<p>
PE<sub>initial</sub> = g&rho;<sub>1</sub>z<sub>1</sub> + g&rho;<sub>2</sub>z<sub>2</sub><br>
PE<sub>initial</sub> = g(&rho;<sub>1</sub>z<sub>1</sub> + &rho;<sub>2</sub>z<sub>2</sub>)
</p>
</blockquote>
<p>
If they exchange positions then the energy becomes
</p>
<blockquote>
<p>
PE<sub>new</sub> = g(&rho;<sub>1</sub>z<sub>2</sub> + &rho;<sub>2</sub>z<sub>1</sub>)
</p>
</blockquote>
<p>
If the change in energy is positive then some of the potential energy has converted to kinetic and the parcels will exchange. Otherwise they won't
</p>
<blockquote>
<p>
PE<sub>new</sub> - PE<sub>initial</sub> = -g(&rho;<sub>1</sub>z<sub>2</sub> + &rho;<sub>2</sub>z<sub>1</sub> - &rho;<sub>1</sub>z<sub>1</sub> - &rho;<sub>2</sub>z<sub>2</sub>)<br>
PE<sub>new</sub> - PE<sub>initial</sub> = -g(&rho;<sub>2</sub> - &rho;<sub>1</sub>)(z<sub>2</sub> - z<sub>1</sub>)<br>
</p>
</blockquote>
<p>
We can rewrite this in terms of the density gradient <i>d&rho;/dz</i> (ie. how fast the density is changing)
</p>
<blockquote>
<p>
<i>since..</i><br>
d&rho;/dz = (&rho;<sub>2</sub> - &rho;<sub>1</sub>)/(z<sub>2</sub> - z<sub>1</sub>)<br>
PE<sub>new</sub> - PE<sub>initial</sub> = -g(d&rho;/dz)(z<sub>2</sub> - z<sub>2</sub>)<sup>2</sup><br>
</p>
</blockquote>
<p>
So as long as the density gradient is positive, potential energy will turn to kinetic and you get convective flow
</p>
</div>
</div>
