climate.org
** Dry Convection in Air
The complication in air is that when your air parcels exchange places they can undergo undergo a change in pressure which leads to adiabatic cooling/heating. So your lighter parcel will float up, but then expand, cool, and sink down. So there is a built-in resistance in the system. To calculate we start with the *First Law of Thermodynamics*
#+begin_quote
\delta{}Q = dU + dW\\
- dU :: change in Energy\\
- dW :: external work done
#+end_quote
In our case we know both terms
#+begin_quote
\delta{}Q = c_{v}dT + p dV
#+end_quote
We choose some starting volume and solve for the change in volume in terms of pressure and density
#+begin_quote
\rho{}V=1\\
V= 1 / \rho{}\\
dV = d(1 / \rho{})\\
dV = - 1 / \rho{}^{2} d\rho{}
#+end_quote
Now we can rewrite the First Law
#+begin_quote
\delta{}Q = c_{v}dT - p / \rho{}^{2} d\rho{}
#+end_quote
But we can also use the perfect gas law to eliminate the pressure term /d\rho{}/. Using..
#+begin_quote
p = \rho{}RT
dp = RTd\rho{} + \rho{}RdT .. /differentiating by parts/
d\rho{} = dp/RT - \rho{}RdT/RT
d\rho{} = dp/RT - \rho{}dT/T
#+end_quote
we rewrite again the first law as
#+begin_quote
\delta{}Q = c_{v}dT - (p / \rho{}^{2}) (dp/RT - \rho{}dT/T)\\
\delta{}Q = c_{v}dT + pdp/RT\rho{}^{2} - pdT/\rho{}T
#+end_quote
Again subsituting the perfect gas law, for /p = \rho{}RT/
#+begin_quote
\delta{}Q = c_{v}dT - dp/\rho{} - RdT
\delta{}Q = (c_{v}-R)dT - dp/\rho{}
#+end_quote
If the system is adiabatic then no energy is added or leaves, so /\delta{}Q = 0/
#+begin_quote
(c_{v}-R)dT = dp/\rho{}
#+end_quote
Furthermore, remember the equilibrium air column, we know that /dp = -g\rho{}_{E}dz/ so
#+begin_quote
(c_{v}-R)dT = -g\rho{}_{E}dz/\rho{}
dT/dz = -g/(c_{v}+R)
#+end_quote
And we have a final equation of how a parcel's temperature changes with altitude when it moves adiabatically. This is the *dry adiabatic lapse rate* - /\Gamma{}_{d}/

The value /c_{v}+R/ is the *specific heat at constant pressure* (written as /c_{p}/) and for air it's /1005 J kg^{-1}K^{-1}/. So the /\Gamma{}_{d} \approx{} 10Kkm^{-1}/

So now if you look at a parcel of air, you need to see how it's /dT/dz/ changes relative to the adiabatic lapse rate. If the temperature drops faster than the lapse rate then your parcel is in an unstable arrangement and you will likely get convection. 

On a larger scale, this means you can have colder air layers over warmer ones without getting an overturn - as long as the temperature difference is below the lapse rate

** Potential Temperature

As a consequence comparing temperatures of gasses becomes complicate b/c they are under different pressures. The solution is to "normalize" temperatures to a constant pressure - called the *potential temperature*. Conceptually this is the temperature of a parcel of air if it were brought down to a fixes pressure (conventionally the surface of the earth - /1000mbar/)
#+begin_quote
*Potential Temperature*:\\
\theta{} = T (p_{0}/p)^{k}\\
/where/ k = R/c_{p} = R/(c_{v}-R) = 2/7 /.. for any perfect diatomic gas/
#+end_quote
We derive this by manipulating the First Law of Thermodynamics and the perfect gas law /p=\rho{}RT/. As we saw previously
#+begin_quote
\delta{}Q = \delta{}Energy + \delata{}Work
\delta{}Q = (c_{v}-R)dT - dp/\rho{}\\
/substitute ../ \rho{} = p/RT\\
\delta{}Q = (c_{v}-R)dT - RTdp/\rho{}\\
/Now if we assume no change in energy - ie. adiabatic changes and/ \delta{}Q=0 \\
dT/T = (R/(c_{v}-R)) dp/p //
/sub calc identity/ dx/x = d\ln{}x\\
\ln{}T = (R/(c_{v}-R)) d\ln{}p //
T =  p^{(R/(c_{v}-R))} + constant //
T/p^{R/(c_{v}-R)} = constant //
#+end_quote
So we see that if you have adiabatic movement then /T/p^{R/(c_{v}-R)}/ remains constant. In practic the pressure is re-expressed as a fraction of the surface pressure
#+begin_quote
\theta{} = T (p_{0}/p)^{R/(c_{v}-R)}\\
/where/ p_{0} = 1000mbar
#+end_quote

The term /{R/(c_{v}-R)}/ is a constant and is shorted to /k/. 

With our new term /\theta{}/ we can compare air parcels directly. If an airparcel with a higher /potential temperature/ is below one with a lower /potential temperature/ then it is in an unstable arrangement and the parcel will rise till it reaches a layer with the same /potential temperature/

When parcels rise they gain momentum and will "overshoot" the area of equal potential temperature, and then sink back to it. This creates an oscillator of sorts - and like a ripple on the surface of water - this greates *gravity waves*

** Moist Air Convection

If we now add moisture into the mix then things get a bit more complicated. We describe the moisture in air in terms of serveral parameters

- Specific Humidity :: /q/ - mass of water vapor to mass of air per unit volume
#+begin_quote
q = \rho{}_{v}/\rho{} \\
/where../ \\
\rho{}_{v} /.. vapor mass/ \\
\rho{} = \rho{}_{d} + \rho{}_{v} /.. total air mass/
#+end_quote

- Saturation-specific humidity :: /q_{*}/ is the humidity at which the the humidity is at a maximum. (ie. /\rho{}_{v}/ is the highest it can be). This maximum is a function of both temperature and pressure.
#+begin_quote
Using the perfect gas law /p=\rho{}RT/ we can also express humidity as a ratio of partial pressures:\\
q_{* } = \rho{}_{saturation}/\rho{}_{dry-air} \\
q_{* } = p_{saturation}/R_[vapor}T] / p_{dry-air}/R_[dry-air}T]\\
q_{* } = (R_{vapor}/R_{dry-air]) (p_{saturation}/p_{dry-air})
#+end_quote
The trick here is that /p_{saturation}/ changes exponentially with temperature. So if an air parcel is moved adiabatically to higher altitude, the pressure and temperature (due to expansion) will both decrease. But the exponential drop of the /p_{saturation}/ term means /q_{*}/ will decrease

- Relative Humidity :: is the percent humidity
#+begin_quote
U = q/q_{*} \times{} 100
#+end_quote


As the air parcel is raised, at some point /q_{*} > q/, the relative humidity reaches 100% and water start to condensce out of the air. This is the /condensation level z_[c}/. Condensation releases energy into the air (b/c of the phase change) which warms the parcel - making the parcel even more bouyant. As before the parcel keeps going up till its temperature and boyancy matches the environment. 

This condensation in effect offsets the cooling of the pressure drop and means that moist air is less stable and mixes easier than dry air.

