climate.html

<div id="outline-container-org7634910" class="outline-3">
<h3 id="org7634910">Dry Convection in Air</h3>
<div class="outline-text-3" id="text-org7634910">
<p>
The complication in air is that when your air parcels exchange places they can undergo undergo a change in pressure which leads to adiabatic cooling/heating. So your lighter parcel will float up, but then expand, cool, and sink down. So there is a built-in resistance in the system. To calculate we start with the <b>First Law of Thermodynamics</b>
</p>
<blockquote>
<p>
&delta;Q = dU + dW<br>
</p>
<dl class="org-dl">
<dt>dU</dt><dd>change in Energy<br></dd>
<dt>dW</dt><dd>external work done</dd>
</dl>
</blockquote>
<p>
In our case we know both terms
</p>
<blockquote>
<p>
&delta;Q = c<sub>v</sub>dT + p dV
</p>
</blockquote>
<p>
We choose some starting volume and solve for the change in volume in terms of pressure and density
</p>
<blockquote>
<p>
&rho;V=1<br>
V= 1 / &rho;<br>
dV = d(1 / &rho;)<br>
dV = - 1 / &rho;<sup>2</sup> d&rho;
</p>
</blockquote>
<p>
Now we can rewrite the First Law
</p>
<blockquote>
<p>
&delta;Q = c<sub>v</sub>dT - p / &rho;<sup>2</sup> d&rho;
</p>
</blockquote>
<p>
But we can also use the perfect gas law to eliminate the pressure term <i>d&rho;</i>. Using..
</p>
<blockquote>
<p>
p = &rho;RT
dp = RTd&rho; + &rho;RdT .. <i>differentiating by parts</i>
d&rho; = dp/RT - &rho;RdT/RT
d&rho; = dp/RT - &rho;dT/T
</p>
</blockquote>
<p>
we rewrite again the first law as
</p>
<blockquote>
<p>
&delta;Q = c<sub>v</sub>dT - (p / &rho;<sup>2</sup>) (dp/RT - &rho;dT/T)<br>
&delta;Q = c<sub>v</sub>dT + pdp/RT&rho;<sup>2</sup> - pdT/&rho;T
</p>
</blockquote>
<p>
Again subsituting the perfect gas law, for <i>p = &rho;RT</i>
</p>
<blockquote>
<p>
&delta;Q = c<sub>v</sub>dT - dp/&rho; - RdT
&delta;Q = (c<sub>v</sub>-R)dT - dp/&rho;
</p>
</blockquote>
<p>
If the system is adiabatic then no energy is added or leaves, so <i>&delta;Q = 0</i>
</p>
<blockquote>
<p>
(c<sub>v</sub>-R)dT = dp/&rho;
</p>
</blockquote>
<p>
Furthermore, remember the equilibrium air column, we know that <i>dp = -g&rho;<sub>E</sub>dz</i> so
</p>
<blockquote>
<p>
(c<sub>v</sub>-R)dT = -g&rho;<sub>E</sub>dz/&rho;
dT/dz = -g/(c<sub>v</sub>+R)
</p>
</blockquote>
<p>
And we have a final equation of how a parcel's temperature changes with altitude when it moves adiabatically. This is the <b>dry adiabatic lapse rate</b> - <i>&Gamma;<sub>d</sub></i>
</p>

<p>
The value <i>c<sub>v</sub>+R</i> is the <b>specific heat at constant pressure</b> (written as <i>c<sub>p</sub></i>) and for air it's <i>1005 J kg<sup>-1</sup>K<sup>-1</sup></i>. So the <i>&Gamma;<sub>d</sub> &asymp; 10Kkm<sup>-1</sup></i>
</p>

<p>
So now if you look at a parcel of air, you need to see how it's <i>dT/dz</i> changes relative to the adiabatic lapse rate. If the temperature drops faster than the lapse rate then your parcel is in an unstable arrangement and you will likely get convection. 
</p>

<p>
On a larger scale, this means you can have colder air layers over warmer ones without getting an overturn - as long as the temperature difference is below the lapse rate
</p>
</div>
</div>

<div id="outline-container-orgae98ff1" class="outline-3">
<h3 id="orgae98ff1">Potential Temperature</h3>
<div class="outline-text-3" id="text-orgae98ff1">
<p>
As a consequence comparing temperatures of gasses becomes complicate b/c they are under different pressures. The solution is to "normalize" temperatures to a constant pressure - called the <b>potential temperature</b>. Conceptually this is the temperature of a parcel of air if it were brought down to a fixes pressure (conventionally the surface of the earth - <i>1000mbar</i>)
</p>
<blockquote>
<p>
<b>Potential Temperature</b>:<br>
&theta; = T (p<sub>0</sub>/p)<sup>k</sup><br>
<i>where</i> k = R/c<sub>p</sub> = R/(c<sub>v</sub>-R) = 2/7 <i>.. for any perfect diatomic gas</i>
</p>
</blockquote>
<p>
We derive this by manipulating the First Law of Thermodynamics and the perfect gas law <i>p=&rho;RT</i>. As we saw previously
</p>
<blockquote>
<p>
&delta;Q = &delta;Energy + \delata{}Work
&delta;Q = (c<sub>v</sub>-R)dT - dp/&rho;<br>
<i>substitute ..</i> &rho; = p/RT<br>
&delta;Q = (c<sub>v</sub>-R)dT - RTdp/&rho;<br>
<i>Now if we assume no change in energy - ie. adiabatic changes and</i> &delta;Q=0 <br>
dT/T = (R/(c<sub>v</sub>-R)) dp/p <i>/
/sub calc identity</i> dx/x = dlnx<br>
lnT = (R/(c<sub>v</sub>-R)) dlnp <i>/
T =  p<sup>(R/(c<sub>v</sub>-R))</sup> + constant /</i>
T/p<sup>R/(c<sub>v</sub>-R)</sup> = constant //
</p>
</blockquote>
<p>
So we see that if you have adiabatic movement then <i>T/p<sup>R/(c<sub>v</sub>-R)</sup></i> remains constant. In practic the pressure is re-expressed as a fraction of the surface pressure
</p>
<blockquote>
<p>
&theta; = T (p<sub>0</sub>/p)<sup>R/(c<sub>v</sub>-R)</sup><br>
<i>where</i> p<sub>0</sub> = 1000mbar
</p>
</blockquote>

<p>
The term <i>{R/(c<sub>v</sub>-R)}</i> is a constant and is shorted to <i>k</i>. 
</p>

<p>
With our new term <i>&theta;</i> we can compare air parcels directly. If an airparcel with a higher <i>potential temperature</i> is below one with a lower <i>potential temperature</i> then it is in an unstable arrangement and the parcel will rise till it reaches a layer with the same <i>potential temperature</i>
</p>

<p>
When parcels rise they gain momentum and will "overshoot" the area of equal potential temperature, and then sink back to it. This creates an oscillator of sorts - and like a ripple on the surface of water - this greates <b>gravity waves</b>
</p>
</div>
</div>

<div id="outline-container-org7d6f765" class="outline-3">
<h3 id="org7d6f765">Moist Air Convection</h3>
<div class="outline-text-3" id="text-org7d6f765">
<p>
If we now add moisture into the mix then things get a bit more complicated. We describe the moisture in air in terms of serveral parameters
</p>

<dl class="org-dl">
<dt>Specific Humidity</dt><dd><i>q</i> - mass of water vapor to mass of air per unit volume</dd>
</dl>
<blockquote>
<p>
q = &rho;<sub>v</sub>/&rho; <br>
<i>where..</i> <br>
&rho;<sub>v</sub> <i>.. vapor mass</i> <br>
&rho; = &rho;<sub>d</sub> + &rho;<sub>v</sub> <i>.. total air mass</i>
</p>
</blockquote>

<dl class="org-dl">
<dt>Saturation-specific humidity</dt><dd><i>q<sub>*</sub></i> is the humidity at which the the humidity is at a maximum. (ie. <i>&rho;<sub>v</sub></i> is the highest it can be). This maximum is a function of both temperature and pressure.</dd>
</dl>
<blockquote>
<p>
Using the perfect gas law <i>p=&rho;RT</i> we can also express humidity as a ratio of partial pressures:<br>
q<sub>* </sub> = &rho;<sub>saturation</sub>/&rho;<sub>dry-air</sub> <br>
q<sub>* </sub> = p<sub>saturation</sub>/R_[vapor}T] / p<sub>dry-air</sub>/R_[dry-air}T]<br>
q<sub>* </sub> = (R<sub>vapor</sub>/R_{dry-air]) (p<sub>saturation</sub>/p<sub>dry-air</sub>)
</p>
</blockquote>
<p>
The trick here is that <i>p<sub>saturation</sub></i> changes exponentially with temperature. So if an air parcel is moved adiabatically to higher altitude, the pressure and temperature (due to expansion) will both decrease. But the exponential drop of the <i>p<sub>saturation</sub></i> term means <i>q<sub>*</sub></i> will decrease
</p>

<dl class="org-dl">
<dt>Relative Humidity</dt><dd>is the percent humidity</dd>
</dl>
<blockquote>
<p>
U = q/q<sub>*</sub> &times; 100
</p>
</blockquote>


<p>
As the air parcel is raised, at some point <i>q<sub>*</sub> &gt; q</i>, the relative humidity reaches 100% and water start to condensce out of the air. This is the <i>condensation level z_[c}</i>. Condensation releases energy into the air (b/c of the phase change) which warms the parcel - making the parcel even more bouyant. As before the parcel keeps going up till its temperature and boyancy matches the environment. 
</p>

<p>
This condensation in effect offsets the cooling of the pressure drop and means that moist air is less stable and mixes easier than dry air.
</p>
</div>
</div>
