climate.html

<div id="outline-container-org84b367c" class="outline-3">
<h3 id="org84b367c">Equivalent potential temperature</h3>
<div class="outline-text-3" id="text-org84b367c">
<p>
We can again incorporate and "normalize" a air parcel so that they can be compared even when they're at different pressure and temperatures. We start with the first law and adiabatic motion again (no net energy) - but we add a correction term for the warming (added energy) of the condensation
</p>

<blockquote>
<p>
&delta;Q = &delta;Energy + \delata{}Work
&delta;Q = [(c<sub>v</sub>-R)dT + Ldq] - dp/&rho;<br>
</p>
</blockquote>

<p>
In the end we can express the <i>equivalent potential temperature - &theta;<sub>e</sub></i> as a function of the <i>potential temperature - &theta;</i> and <i>humidity - q</i>
</p>

<blockquote>
<p>
&theta;<sub>e</sub> = &theta; e<sup>(Lq/c<sub>p</sub>T)</sup><br>
L <i>.. latent heat of condensation</i>
</p>
</blockquote>
<p>
When <i>q</i> is zero you get back <i>&theta;</i>
</p>

<p>
This terms is used in the same exact way as <i>&theta;</i> - as is the primary term we should be looking at for air convection. Around the tropics, where we have a lot of air rising, &theta;<sub>e</sub>\ is pretty constant with altitude (indicating instability)
</p>
</div>
</div>
</div>

<div id="outline-container-org42937ec" class="outline-2">
<h2 id="org42937ec">Meridonal structure of the atmosphere</h2>
<div class="outline-text-2" id="text-org42937ec">
</div>
<div id="outline-container-orga77acbd" class="outline-4">
<h4 id="orga77acbd">Tilt</h4>
<div class="outline-text-4" id="text-orga77acbd">
<p>
If the Earth has no tilt then the poles would recieve no radiation. The tilt ensures that during their respective summer each pole recieves some radiation. This has the cummulative effect of evening out the amount of radiation absorbed by the Earth
</p>
</div>
</div>

<div id="outline-container-orgb7e2b99" class="outline-4">
<h4 id="orgb7e2b99">Sphericity</h4>
<div class="outline-text-4" id="text-orgb7e2b99">
<p>
Due to the Earth's sphericity and the albedo of polar ice/snow, the tropics absorb about &times;6 more radiation than the poles.
</p>

<p>
And yet the outgoing radiation doesn't differ by as much. This is due to heat being transported poleward. This happens both through the atmosphere as well as the oceans
</p>
</div>
</div>

<div id="outline-container-orge7d4e67" class="outline-4">
<h4 id="orge7d4e67">Potential temperature</h4>
<div class="outline-text-4" id="text-orge7d4e67">
<p>
B/c convection is generally driven by moist air, the dry-air convection's <i>potential temperature</i> is generally secondary. Therefore the atmosphere is generally "warmer" in terms of potential temperature as you go up. However, the actual (nonpressure-corrected) temperature decreases (and hence the <i>saturated specific humidity</i>). The potential temperature starts to rapidly change in thin layers once you've reaches the stratosphere
</p>
</div>
</div>

<div id="outline-container-org817ba0b" class="outline-4">
<h4 id="org817ba0b">Equivalent potential temperature</h4>
<div class="outline-text-4" id="text-org817ba0b">
<p>
The moisture corrected temperature however doesn't change as you look up in altitude when you are in the tropics. This however changes a bit towards the poles. This is due to intense equatorial convection. We can look at the resulting isolines to determine where air can move along adiabatically
</p>
</div>
</div>

<div id="outline-container-org45aac81" class="outline-4">
<h4 id="org45aac81">Stratosphere</h4>
<div class="outline-text-4" id="text-org45aac81">
<p>
Is deliniated from the troposphere by the tropopause. Due to the equatorial convection, the tropopause is pushed upwards in the tropics - so it does not form a smooth spherical layer. Furthermore there are <i>tropopause gaps</i> where the temperature is warm enough to allow stratosphere air to mix with the upper troposphere air directly (caused by jet streams.. to be revisited..)
</p>
</div>
</div>

<div id="outline-container-orga3e790d" class="outline-3">
<h3 id="orga3e790d">Pressure vs Height</h3>
<div class="outline-text-3" id="text-orga3e790d">
<p>
Pressure is simpler to measure. It is in effect a measure of "the overlying mass burden" (how much air is above a point) and is known as a <i>mass coordinate</i>.
</p>

<p>
Of course pressure and height as mutually dependent. As we saw before there is a net zero balance of forces on a static pair parcel. When looking at in terms of densities <i>&rho;</i>
</p>

<blockquote>
<p>
Pressure<sub>below</sub> + Pressure<sub>above</sub> + gravity = 0 <br>
p&delta;A - (p+&delta;p)&delta;A + &delta;p/&delta;z + g&rho;&delta;A&delta;z = 0 <br>
&part;p/&part;z + g&rho; = 0 <br>
</p>
</blockquote>
<p>
Here we can rewrite the density term <i>&rho;</i> in terms of temperature <i>T</i> and pressure <i>p</i> using the perfect gas law <i>p=&rho;RT</i>
</p>
<blockquote>
<p>
&part;p/&part;z + gp/[RT] = 0 <br>
</p>
</blockquote>
<p>
Rearranging things a bit 
</p>
<blockquote>
<p>
&part;z p / &part;p = -g/[RT] <br>
&part;z / &part;lnp = -g/[RT] <i>.. using the calculus idenity</i> p &part;/&part;p = &part;/&part;lnp<br>
z(p) = R &int;<sub>p</sub><sup>p<sub>s</sub></sup> [T/g] dp/p
</p>
</blockquote>
<p>
And we can now calculate the height <i>z</i> of a given pressure "surface"  <i>p</i>. It depends on the average temperature below it (<i>T</i> is a function of <i>p</i> here and needs to be integrated) as well as the surface pressure <i>p<sub>s</sub></i>. The equation assumes a static <i>g</i> - so this kind of calculation will drift from the true height when you are at very high altitudes (ie. mesosphere ~100km)
</p>

<p>
In general <i>z</i> and <i>p</i> covary. A low pressure surface corresponds to a lower <i>z</i> height. And generally pressure surfaces are high in the tropics and low at the poles b/c the integral/average of the temperature below a pressure surface is higher in the tropics. Cold air columns contract and warm columns expand.
</p>
</div>
</div>

<div id="outline-container-orgc501438" class="outline-3">
<h3 id="orgc501438">Winds</h3>
<div class="outline-text-3" id="text-orgc501438">
<p>
The resulting difference in pressure surface height drives air mass poleward from the tropics and creates winds.
(However the pressure difference seems to be offset by Coriolis forces)
</p>

<p>
One would expect a large "cell" to form where air rises at the equator, moves to the poles, and then falls back to the surface. However this isn't the case. Instead you get two cells (no explanation!) on each hemisphere, with only the tropical cell behaving the way we expect - with the surface winds being towards the equator.
</p>

<p>
There is also a <i>zonal-wind</i> (east/west) component. In the tropics winds are westward <b>Easterlies</b>, while away from the tropics they are eastward <b>Westerlies</b>. The East/West divide only roughly corresponds to the overturn cell. So at the surface winds that are towards the equator are generally also westward - but on the graphs there is a bit of a mismatch at altitude.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
